# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/services"

# ------------------------------------------------------------------------------
# CLI tools
# ------------------------------------------------------------------------------
brew "asitop"
brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "cmake"
brew "cmatrix"
brew "eza"
brew "fzf"
brew "git"
brew "git-delta"
brew "helix"
brew "htop"
brew "openssl"
brew "http-server"
brew "jq"
brew "mackup"
brew "mas"
brew "meson"
brew "mosquitto"
brew "nano"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "npm"
brew "py3cairo"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "speedtest-cli"
brew "tmux"
brew "tree"
brew "typst"
brew "wget"
brew "onefetch"
brew "clang-format"
brew "tldr"

# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------
cask "aerial"
cask "aldente"
cask "alt-tab"
cask "android-platform-tools"
cask "apparency"

cask "balenaetcher"
cask "betterdisplay"
# cask "bitwarden" # Prefer Mac App Store version (Touch ID support)
cask "bluesnooze"

cask "cork"

cask "daisydisk"
cask "dolphin@dev"

cask "ghostty"
cask "google-chrome"

cask "iina"
cask "iterm2"

cask "jordanbaird-ice"
cask "jellyfin-media-player"

cask "karabiner-elements"
cask "keka"

cask "latest"
cask "linearmouse"
cask "localsend"
cask "lookaway"

#cask "macwhisper"
#cask "moonlight"

cask "numi"

cask "obsidian"
#cask "onyx"

cask "pearcleaner"
cask "ppsspp-emulator"
cask "protonvpn"

cask "qlmarkdown"
cask "qlvideo"

cask "raycast"
# cask "rectangle" # Replaced by Raycast
cask "reflex-app"
cask "rustdesk"

cask "shottr"
# cask "stats" # Replaced by iStat Menus
cask "syntax-highlight"

cask "tradingview"
cask "transmission"
cask "trex"

cask "visual-studio-code"

cask "whisky"

# ------------------------------------------------------------------------------
# Fonts 
# ------------------------------------------------------------------------------
cask "font-meslo-lg-nerd-font"
cask "font-fira-code"

# ------------------------------------------------------------------------------
# VS Code extensions
# ------------------------------------------------------------------------------
vscode "angablue.asm-formatter"
vscode "catppuccin.catppuccin-vsc"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kdarkhan.mips"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "puorc.awesome-vhdl"
vscode "redhat.vscode-xml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"

# ------------------------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------------------------

# Safari extensions
mas "AdGuard for Safari", id: 1440147259
mas "Consent-O-Matic", id: 1606897889
mas "Hover for Safari", id: 1540705431
mas "Hush", id: 1544743900
mas "Keepa - Price Tracker", id: 1533805339
mas "Protego", id: 6737959724

# Microsoft
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
#mas "Microsoft OneNote", id: 784801555
mas "OneDrive", id: 823766827

mas "Bitwarden", id: 1352778147
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Flighty", id: 1358823008
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067 
mas "Mela", id: 1568924476
mas "Pi-hole Remote", id: 1515445551
mas "Playlisty for Apple Music", id: 1459275972
mas "Prime Video", id: 545519333
