# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/services"
tap "RhetTbull/osxphotos"

# ------------------------------------------------------------------------------
# CLI tools
# ------------------------------------------------------------------------------
brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "eza"
brew "fzf"
brew "ffmpeg"
brew "git"
brew "git-delta"
brew "htop"
brew "openssl"
brew "http-server"
brew "immich-go"
brew "jq"
brew "mackup"
brew "mactop"
brew "mas"
brew "meson"
brew "mosquitto"
brew "nano"
brew "neofetch"
brew "neovim"
brew "nvm"
# brew "npm"
brew "onefetch"
brew "py3cairo"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "rhettbull/osxphotos/osxphotos"
brew "rsync" # Replaces old implementation of openrsync by Apple
brew "speedtest-cli"
brew "tldr"
brew "tmux"
brew "tree"
brew "typst"
brew "wakeonlan"
brew "wget"
brew "xquartz" # X Graphics server for ssh -X sessions

# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------
# cask "aerial" # Prefer built-in screensavers  
cask "aldente"
cask "alt-tab"
# cask "android-platform-tools"
cask "apparency"

# cask "balenaetcher"
cask "betterdisplay"
# cask "bitwarden" # Prefer Mac App Store version (Touch ID support)
cask "bluesnooze"

cask "cool-retro-term"
cask "cork"

cask "daisydisk"
cask "dolphin@dev"

cask "firefox"
cask "fliqlo" # Clock wallpaper

cask "ghostty"
cask "google-chrome"

cask "iina"
cask "iterm2"

cask "jellyfin-media-player"
cask "jordanbaird-ice"

cask "karabiner-elements"
cask "keka"

cask "latest"
cask "linearmouse"
cask "localsend"
#cask "lookaway"

#cask "macwhisper"
#cask "moonlight"

cask "numi"

cask "obsidian"
cask "onyx"

cask "pcsx2"
cask "pearcleaner"
cask "ppsspp-emulator"
cask "protonvpn"

cask "qlmarkdown"
cask "qlvideo"

cask "raycast"
cask "reflex-app"
cask "rustdesk"

cask "shottr"
# cask "stats" # Replaced by iStat Menus
cask "sony-ps-remote-play"
cask "syntax-highlight"

cask "tailscale-app"
cask "tradingview"
cask "transmission"
cask "trex"

cask "upscayl"

cask "visual-studio-code"

cask "whisky"

# cask "xquartz" # X11 graphics support (ssh)

# ------------------------------------------------------------------------------
# Fonts 
# ------------------------------------------------------------------------------
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"

# ------------------------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------------------------

# Safari extensions
mas "AdGuard for Safari", id: 1440147259
mas "Consent-O-Matic", id: 1606897889
mas "Hover for Safari", id: 1540705431
mas "Hush", id: 1544743900
mas "Keepa - Price Tracker", id: 1533805339
mas "Protego", id: 6737959724

# Microsoft
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
#mas "Microsoft OneNote", id: 784801555
mas "OneDrive", id: 823766827

mas "Bitwarden", id: 1352778147
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Flighty", id: 1358823008
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067 
mas "Mela", id: 1568924476
mas "Pi-hole Remote", id: 1515445551
mas "Playlisty for Apple Music", id: 1459275972
mas "Prime Video", id: 545519333
