# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/services"

# ------------------------------------------------------------------------------
# CLI tools
# ------------------------------------------------------------------------------
brew "asitop"
brew "python@3.12"
brew "glib"
brew "at-spi2-core"
brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "cmake"
brew "cmatrix"
brew "eza"
brew "fzf"
brew "libtiff"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gobject-introspection"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gtk-mac-integration"
brew "helix"
brew "htop"
brew "openssl@1.1"
brew "http-server"
brew "jq"
brew "librsvg"
brew "mackup"
brew "mas"
brew "meson"
brew "micro"
brew "mosquitto"
brew "nano"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "py3cairo"
brew "pyenv"
brew "pygobject3"
brew "python@3.10"
brew "python@3.11"
brew "sherlock"
brew "speedtest-cli"
brew "tmux"
brew "tree"
brew "typst"
brew "wget"
brew "onefetch"

# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------
cask "aerial"
cask "android-platform-tools"
cask "aldente"
cask "alt-tab"
cask "betterdisplay"
cask "bitwarden"
cask "bluesnooze"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "linearmouse"
cask "lookaway"
cask "moonlight"
cask "numi"
cask "obsidian"
cask "onyx"
cask "pearcleaner"
cask "qlvideo"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "reflex"
cask "shottr"
cask "spotify"
cask "stats"
cask "syntax-highlight"
cask "tradingview"
cask "transmission"
cask "visual-studio-code"
cask "trex"

# ------------------------------------------------------------------------------
# Fonts 
# ------------------------------------------------------------------------------
cask "font-meslo-lg-nerd-font"

# ------------------------------------------------------------------------------
# VS Code extensions
# ------------------------------------------------------------------------------
vscode "angablue.asm-formatter"
vscode "angular.ng-template"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kdarkhan.mips"
vscode "mhutchie.git-graph"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "puorc.awesome-vhdl"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "xabikos.javascriptsnippets"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"

# ------------------------------------------------------------------------------
# Mac App Store
# ------------------------------------------------------------------------------

# Safari extensions
mas "AdGuard for Safari", id: 1440147259
mas "Hush", id: 1544743900
mas "Consent-O-Matic", id: 1606897889
mas "Hover for Safari", id: 1540705431
mas "Keepa - Price Tracker", id: 1533805339

# Microsoft
mas "Microsoft Excel", id: 462058435
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "OneDrive", id: 823766827

mas "Klack", id: 6446206067 
mas "Bitwarden", id: 1352778147
mas "ColorSlurp", id: 1287239339
mas "Developer", id: 640199958
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Mela", id: 1568924476
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 1615523079
mas "Playlisty for Apple Music", id: 1459275972
mas "Prime Video", id: 545519333
